package org.mac.sample.groovy.datatype

/*
 *          (          (
 *          )\ )  (    )\   )  )     (
 *  (  (   (()/( ))\( ((_| /( /((   ))\
 *  )\ )\   ((_))((_)\ _ )(_)|_))\ /((_)
 * ((_|(_)  _| (_))((_) ((_)__)((_|_))
 * / _/ _ \/ _` / -_|_-< / _` \ V // -_)
 * \__\___/\__,_\___/__/_\__,_|\_/ \___|
 *
 * 东隅已逝，桑榆非晚。(The time has passed,it is not too late.)
 * 虽不能至，心向往之。(Although I can't, my heart is longing for it.)
 *
 */

/**
 * groovy代码中，任何时候看到专有类型值（比如数字5，或者布尔值true），它都
 * 是相应的包装类型实例的一个引用。为了简洁和习惯，groovy允许声明变量为专有类型的
 * 变量，但是不要被欺骗，后台真正使用的类型是包装类型.
 */


